package com.fox.understandcaremperor.ui.activity;

import android.app.ActionBar;
import android.os.Bundle;
import android.view.MenuItem;
import android.widget.TextView;

import androidx.appcompat.app.AppCompatActivity;
import androidx.appcompat.widget.Toolbar;

import com.alibaba.android.arouter.facade.annotation.Route;
import com.fox.understandcaremperor.R;

import butterknife.BindView;
import butterknife.ButterKnife;

@Route(path = "/app/UserAgreementActivity")
public class UserAgreementActivity extends AppCompatActivity {

    @BindView(R.id.toolbar)
    Toolbar toolbar;
    @BindView(R.id.tv_user_agreement)
    TextView tvUserAgreement;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_user_agreement);
        ButterKnife.bind(this);

        setSupportActionBar(toolbar);
        ActionBar actionBar = getActionBar();
        if (actionBar!=null){
            actionBar.setDisplayHomeAsUpEnabled(true);
        }

        String text = "一、协议的接受、变更与补充\n" +
                "1、勾选本协议前选项框并点击“注册”，将视为您签署了本协议，表明您自愿接受本协议全部条款的约束，本协议将构成您与上海佰集科技有限公司及其经营的“简书”平台（以下统称“简书”，包括相关关联方）之间具有约束力的法律文件。无论您是进入简书浏览网页，还是在简书上发布任何内容，或者是直接或通过各类方式（如站外API引用等）间接使用简书网服务和数据的行为，都将被视作已无条件接受本声明所涉全部内容。\n" +
                "\n" +
                "2、简书有权利对本协议进行修改，协议修改后，简书将通过在相关页面公告或发送通知等方式公布修改的内容，修改后的协议一经公布即有效的代替原协议。如果您不同意本协议的修改，请立即停止访问或使用本网站或取消已经获得的服务；如果您选择继续访问或使用本网站，则视为您已接受本协议的修改。\n" +
                "\n" +
                "3、签署的本协议所列明的条款，并不能完全涵盖您与简书之间所有的权利和义务。因此，简书不定期公布的其他声明、规则等均视为本协议之补充协议，为本协议不可分割的组成部分，与本协议具有同等法律效力。\n" +
                "\n" +
                "4、如本协议与简书平台其它协议条款不一致，以其它协议条款内容为准。\n" +
                "\n" +
                "二、帐号密码与注册、登录\n" +
                "1、帐号的取得\n" +
                "(1)您确认，在您开始注册简书前，已经具备中华人民共和国法律规定的与您行为相适应的民事行为能力。若您不具备前述与您行为相适应的民事行为能力，则您及您的监护人应依照法律规定承担因此而导致的一切后果。\n" +
                "\n" +
                "(2)您注册成功后，即成为简书注册用户，用户须对在简书的注册信息的真实性、合法性、有效性承担全部责任。您可自行创建、修改昵称，但用户名和昵称的命名及使用应遵守相关法律法规并符合网络道德，不得冒充他人或恶意注册使人误认；不得利用他人的名义发布任何信息；不得恶意使用注册帐号导致其他用户误认；用户名和昵称中不能含有任何侮辱、诽谤、淫秽或暴力等侵害他人合法权益或违反公序良俗的词语。如您违反前述规定，简书有权随时限制或拒绝您使用该账号，甚至注销该账号。\n" +
                "(3)用户名的管理\n" +
                "1)请勿以党和国家领导人或其他名人的真实姓名、字、号、艺名、笔名、头衔等注册和使用昵称（如确为本人，需要提交相关证据并通过审核方可允许使用）；\n" +
                "2)请勿以国家组织机构或其他组织机构的名称等注册和使用昵称（如确为该机构，需要提交相关证据并通过审核方可允许使用）；\n" +
                "3)请勿注册和使用与其他网友相同、相仿的用户名或昵称；\n" +
                "4)请勿注册和使用不文明、不健康的用户名和昵称；\n" +
                "5)请勿注册和使用易产生歧义、引起他人误解或带有各种奇形怪状符号的用户名和昵称。\n" +
                "6)用户以虚假信息骗取账号名称注册，或账号头像、简介等注册信息存在违法和不良信息的，简书将暂停或注销。\n" +
                "\n" +
                "2、请您妥善保管您注册时填写的用户帐号和密码，不要将帐号密码告知他人，因用户原因导致帐号或密码泄露而造成的法律后果由用户负责。同时，用户还应当对以此帐号登录进行的所有活动和事件承担全部后果与法律责任。\n" +
                "\n" +
                "3、若您的帐号或密码遗失，可以通过注册信息按照相关步骤找回密码，若您发现账号遭到未授权的使用或存在其他安全漏洞的情况，应立即告知简书。\n" +
                "\n" +
                "三、用户个人信息\n" +
                "1、个人信息的保护\n" +
                "(1)保护用户个人信息及个人隐私是简书的基本原则之一。\n" +
                "\n" +
                "(2)您在注册帐号或使用简书服务的过程中，需要填写一些必要的信息。若国家法律法规有特殊规定的，您可能还需要填写真实的身份信息。若您填写的信息不完整，可能无法注册帐户，或在使用简书服务过程中受到限制。\n" +
                "\n" +
                "(3)我们将尽一切可能采取适当的技术手段，保证您可以访问、更新和更正自己的注册信息或使用我们的服务时提供的其他个人信息，但出于安全性和身份识别（如找回密码服务）的考虑，您可能无法修改注册时提供的初始注册信息及其他验证信息。\n" +
                "\n" +
                "(4)简书将运用各种安全技术和程序建立完善的管理制度来保护您的个人信息，以免遭受未经授权的访问、使用或披露。\n" +
                "\n" +
                "(5)未经您的同意，简书不会向简书以外的任何公司、组织和个人披露您的个人信息，但法律法规另有规定的除外。\n" +
                "\n" +
                "(6)简书非常重视对未成年人个人信息的保护，若未成年人（尤其是十岁以下）希望得以使用简书提供的服务，必须得到父母（监护人）的同意。\n" +
                "\n" +
                "(7)简书将通过技术手段、强化内部管理等办法充分保护用户的个人隐私信息，保证不对外公开或向第三方披露或提供用户注册资料及用户在使用网络服务时存储在简书平台、服务器或数据库的非公开内容和信息，但下列情况除外：\n" +
                "1) 事先获得用户的授权；\n" +
                "2) 根据有关的法律法规要求；\n" +
                "3) 按照相关政府主管部门和司法机关的要求；\n" +
                "4) 为维护社会公众的利益；\n" +
                "5) 为维护简书的合法权益。\n" +
                "\n" +
                "2、个人信息的收集\n" +
                "简书在提供服务时，可能会收集、储存和使用下列与您有关的信息。如果您不提供相关信息，可能无法注册成为我们的用户或无法享受我们提供的某些服务，或者无法达到相关服务拟达到的效果。\n" +
                "(1) 您提供的信息\n" +
                "\n" +
                "    您在注册帐户或使用简书的服务时，向我们提供的相关个人信息，包括但不限于真实姓名、证件信息、电话号码、地址、电子邮件等；\n" +
                "    您通过简书的服务向其他方提供的共享信息，以及您使用我们的服务时所储存的信息。\n" +
                "\n" +
                "(2)我们获取的您的信息\n" +
                "您使用简书服务时我们可能收集如下信息：使用简书服务时，系统可能通过cookies、web beacon或其他方式自动采集的技术信息，包括：\n" +
                "1) 设备或软件信息，包括但不限于您的移动设备、网页浏览器或用于接入我们服务的其他程序所提供的配置信息、您的IP地址、位置信息、设备存储和移动设备所用的版本和设备识别码；\n" +
                "2) 在使用我们服务时搜索或浏览的信息，包括但不限于您浏览过的文章、搜索的关键词，以及您在使用我们服务时浏览或要求提供的其他信息和内容详情；\n" +
                "3) 有关您曾使用的移动应用（APP）和其他软件的信息，以及您曾经使用该等移动应用和软件的信息。\n" +
                "\n" +
                "3、个人信息的使用\n" +
                "(1)我们可能将在向您提供服务的过程之中所收集的信息用作下列用途：\n" +
                "1) 向您提供服务；\n" +
                "2) 在我们提供服务时，用于身份验证、客户服务、安全防范、诈骗监测、存档和备份用途，确保我们向您提供的产品和服务的安全性；\n" +
                "3) 帮助我们设计新服务，改善我们现有服务；\n" +
                "4) 使我们更加了解您如何接入和使用我们的服务，从而针对性地回应您的个性化需求，例如个性化的帮助服务和指示，或对您和其他用户作出其他方面的回应；\n" +
                "5) 软件认证或管理软件升级；\n" +
                "6) 让您参与有关我们产品和服务的调查。\n" +
                "\n" +
                "(2)为了让您有更好的体验，也为了改善我们的服务，在符合相关法律法规的前提下，我们可能将通过某一项服务收集信息或向第三方提供用户的非个人隐私信息的方式，用于我们的其他服务。例如，在您使用我们的一项服务时所收集的信息，可能会用于向您提供特定内容，或向您展示与您相关的、非普遍推送的信息。\n";
        tvUserAgreement.setText(text);
    }

    @Override
    protected void onDestroy() {
        super.onDestroy();
    }


    @Override
    public boolean onOptionsItemSelected(MenuItem item) {//设置菜单栏响应事件
        switch (item.getItemId()) {
            case android.R.id.home://home按钮
                finish();
                break;
        }
        return true;
    }
}